conf/src/Documents/ЭП_ПланированиеТрудозатрат/ЭП_ПланированиеТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_ПланированиеТрудозатрат</name>
  <comment> Спиридонов А.И. 09.12.2024</comment>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.ЭП_СогласованныеЧасыПереработок</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_УчетОтгулов</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ЧасыПереработокНаСогласование</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ЭП_СтатусыДокументаУтверждениеПереработок</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРасчетногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРасчетногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеПланаОтветственными</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеФактаОтветственными</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеОтветственными</name>
    <type>
      <types>EnumRef.ЭП_СогласованиеПланаФакта</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещениеСообщений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОтсветсвенных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ЭП_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.РазделыПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТехническийПроект</name>
      <type>
        <types>CatalogRef.ТехническиеПроекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.ЗадачиПроцесса</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыПоТабелю</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Департамент</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Отгул</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыПереработок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПротоколВзаимодействия</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстПоручения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительУтвержденияПереработок</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.ЭП_СтатусыДокументаУтверждениеПереработок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/AccumulationRegisters/ЭП_СогласованныеЧасыПереработок/ЭП_СогласованныеЧасыПереработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_СогласованныеЧасыПереработок</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отгул</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/AccumulationRegisters/ЭП_УчетОтгулов/ЭП_УчетОтгулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_УчетОтгулов</name>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/AccumulationRegisters/ЭП_ЧасыПереработокНаСогласование/ЭП_ЧасыПереработокНаСогласование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_ЧасыПереработокНаСогласование</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отгул</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/Enums/ЭП_СтатусыДокументаУтверждениеПереработок/ЭП_СтатусыДокументаУтверждениеПереработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_СтатусыДокументаУтверждениеПереработок</name>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>СогласованОтветственными</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>НовыйДокумент</name>
  </enumValues>
</mdclass:Enum>

conf/src/Documents/ЭП_ПланированиеТрудозатрат/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ) 
	
	
	Отказ = ПроверитьПересеченияЧасовСОтгулами();
	
	Движения.ЭП_СогласованныеЧасыПереработок.Записывать = Истина;
    Движения.ЭП_УчетОтгулов.Записывать = Истина; 
	Движения.ЭП_ЧасыПереработокНаСогласование.Записывать = Истина;
	
	Движения.ЭП_СогласованныеЧасыПереработок.Очистить();
	Движения.ЭП_УчетОтгулов.Очистить();
	Движения.ЭП_ЧасыПереработокНаСогласование.Очистить();
	
	Если Статус = ПредопределенноеЗначение("Перечисление.ЭП_СтатусыДокументаУтверждениеПереработок.СогласованОтветственными") Тогда
		
		Движения.ЭП_СогласованныеЧасыПереработок.Записывать = Истина;
        Движения.ЭП_УчетОтгулов.Записывать = Истина; 
		ВыборкаСотрудник = ПолучитьТаблицуДляДвиженийОтгулы(Ссылка);
		
		Пока ВыборкаСотрудник.Следующий() Цикл 
			Движение = Движения.ЭП_СогласованныеЧасыПереработок.Добавить();
			Движение.Период = ВыборкаСотрудник.Дата;
			Движение.Сотрудник = ВыборкаСотрудник.Сотрудник;
			Движение.Отгул = ВыборкаСотрудник.Отгул; 
			Движение.Проект = Проект;
			Движение.Количество = ВыборкаСотрудник.ЧасыПереработок;
			Если ВыборкаСотрудник.Отгул Тогда
				
				Движение = Движения.ЭП_УчетОтгулов.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = ВыборкаСотрудник.Дата;
				Движение.Сотрудник = ВыборкаСотрудник.Сотрудник;
				Движение.Длительность = ВыборкаСотрудник.ЧасыПереработок; 
				
			КонецЕсли;

		КонецЦикла;	
	ИначеЕсли Статус = Перечисления.ЭП_СтатусыДокументаУтверждениеПереработок.НаСогласовании ИЛИ
		Статус = Перечисления.ЭП_СтатусыДокументаУтверждениеПереработок.НовыйДокумент Тогда
		
		ВыборкаСотрудник = ПолучитьТаблицуДляДвиженийОтгулы(Ссылка);
		
		Пока ВыборкаСотрудник.Следующий() Цикл
			Движение = Движения.ЭП_ЧасыПереработокНаСогласование.Добавить();
			Движение.Период = ВыборкаСотрудник.Дата;
			Движение.Сотрудник = ВыборкаСотрудник.Сотрудник;
			Движение.Отгул = ВыборкаСотрудник.Отгул; 
			Движение.Проект = Проект;
			Движение.Количество = ВыборкаСотрудник.ЧасыПереработок;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекСтрокаСотрудники.ЧасыПереработок) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнены часы в строке номер " + ТекСтрокаСотрудники.НомерСтроки;
			Сообщение.Сообщить();
		КонецЕсли;
		
	КонецЦикла;
				
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	ПротоколВзаимодействия.Очистить();	
	Ответственный = Пользователи.ТекущийПользователь();
    ОповещениеСообщений = Ложь;
		
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуДляДвиженийОтгулы(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_ПланированиеТрудозатратСотрудники.Сотрудник КАК Сотрудник,
		|	ЭП_ПланированиеТрудозатратСотрудники.Отгул КАК Отгул,
		|	СУММА(ЭП_ПланированиеТрудозатратСотрудники.ЧасыПереработок) КАК ЧасыПереработок,
		|	ЭП_ПланированиеТрудозатратСотрудники.Дата КАК Дата
		|ИЗ
		|	Документ.ЭП_ПланированиеТрудозатрат.Сотрудники КАК ЭП_ПланированиеТрудозатратСотрудники
		|ГДЕ
		|	ЭП_ПланированиеТрудозатратСотрудники.Ссылка = &Документ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЭП_ПланированиеТрудозатратСотрудники.Сотрудник,
		|	ЭП_ПланированиеТрудозатратСотрудники.Отгул,
		|	ЭП_ПланированиеТрудозатратСотрудники.Дата";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ТаблицаОтулов = РезультатЗапроса.Выбрать();
		Возврат ТаблицаОтулов;		
	КонецЕсли;

КонецФункции

Функция ПроверитьПересеченияЧасовСОтгулами()

	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.ЭП_СтатусыДокументаУтверждениеПереработок.НовыйДокумент);
	МассивСтатусов.Добавить(Перечисления.ЭП_СтатусыДокументаУтверждениеПереработок.НаСогласовании);
	//МассивСтатусов.Добавить(Перечисления.ЭП_СтатусыДокументаУтверждениеПереработок.Утвержден);
	МассивСтатусов.Добавить(Перечисления.ЭП_СтатусыДокументаУтверждениеПереработок.СогласованОтветственными);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭП_ПланированиеТрудозатратСотрудники.Сотрудник КАК Сотрудник,
	               |	ЭП_ПланированиеТрудозатратСотрудники.Дата КАК Дата
	               |ПОМЕСТИТЬ ВТ_ТекущийДокумент
	               |ИЗ
	               |	Документ.ЭП_ПланированиеТрудозатрат.Сотрудники КАК ЭП_ПланированиеТрудозатратСотрудники
	               |ГДЕ
	               |	ЭП_ПланированиеТрудозатратСотрудники.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭП_ПланированиеТрудозатратСотрудники.Сотрудник КАК Сотрудник,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЭП_ПланированиеТрудозатратСотрудники.Отгул) КАК Отгул,
	               |	ЭП_ПланированиеТрудозатратСотрудники.Дата КАК Дата
	               |ПОМЕСТИТЬ ВТ_СотрудникиРазница
	               |ИЗ
	               |	Документ.ЭП_ПланированиеТрудозатрат.Сотрудники КАК ЭП_ПланированиеТрудозатратСотрудники
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТекущийДокумент КАК ВТ_ТекущийДокумент
	               |		ПО ЭП_ПланированиеТрудозатратСотрудники.Сотрудник = ВТ_ТекущийДокумент.Сотрудник
	               |			И ЭП_ПланированиеТрудозатратСотрудники.Дата = ВТ_ТекущийДокумент.Дата
	               |ГДЕ
	               |	ЭП_ПланированиеТрудозатратСотрудники.Ссылка.Статус В(&Статусы)
	               |	И НЕ ЭП_ПланированиеТрудозатратСотрудники.Ссылка.ПометкаУдаления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭП_ПланированиеТрудозатратСотрудники.Сотрудник,
	               |	ЭП_ПланированиеТрудозатратСотрудники.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СотрудникиРазница.Сотрудник КАК Сотрудник,
	               |	ВТ_СотрудникиРазница.Отгул КАК Отгул,
	               |	ВТ_СотрудникиРазница.Дата КАК Дата
	               |ИЗ
	               |	ВТ_СотрудникиРазница КАК ВТ_СотрудникиРазница
	               |ГДЕ
	               |	ВТ_СотрудникиРазница.Отгул > 1";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов);
	РезультатЗапроса = Запрос.Выполнить();
		
	Если РезультатЗапроса.Пустой() Тогда
	
		Возврат Ложь;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = "По сотруднику %1 на дату %2 зарегистрирован отгул/часы другим документом. Возможно зарегистрировать только один вид компенсации в день";		
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(ТекстСообщения, Выборка.Сотрудник, Выборка.Дата);        
			Сообщение.Сообщить();			
		
		КонецЦикла;
		
		Возврат Истина;
	
	КонецЕсли;
	
КонецФункции // ()


#КонецОбласти
